In [85]:
#import pandas
import pandas as pd
import numpy as np

In [94]:
#abro el archivo csv
df_PS_20200413=pd.read_csv('C:\\Users\\HP\\Documents\\Data Science\\Datasets PI1\\precios_semana_20200413.csv', sep=',', decimal='.', encoding='utf-16')

In [95]:
#Visualizo el df
df_PS_20200413.head()

   precio    producto_id sucursal_id
0   29.90  0000000001663     2-1-014
1   29.90  0000000002288     2-1-032
2   39.90  0000000002288     2-1-096
3  499.99  0000000205870     9-1-686
4  519.99  0000000205870     9-2-248

In [96]:
#Verifico cantidad de vacios
df_PS_20200413.isna().sum()

precio         13
producto_id    15
sucursal_id    15
dtype: int64

In [97]:
df_PS_20200413.isnull().sum()

precio         13
producto_id    15
sucursal_id    15
dtype: int64

In [20]:
#por el analisis realizado del Data Frame
# Elimino las filas con datos faltantes
df_PS_20200413.dropna(inplace = True)

In [21]:
df_PS_20200413.count()

precio         472125
producto_id    472125
sucursal_id    472125
dtype: int64

In [22]:
df_PS_20200413.drop_duplicates(inplace=True)

In [23]:
#Verifico cantidad de vacios nuevamente
df_PS_20200413.isna().sum()

precio         0
producto_id    0
sucursal_id    0
dtype: int64

In [24]:
#Elaboro función para quitar digitos excedentes en Datos
def saca_digitos(x):
    if type(x) != "str" :
        x = str(x)
    if (x.find("-") != -1):
        return x.split("-")[2]
    return x

In [25]:
#Aplico la función id_P en columna producto_id
df_PS_20200413["producto_id"]=df_PS_20200413["producto_id"].apply(saca_digitos)

In [26]:
df_PS_20200413.to_csv('precios_semana_20200413.csv', sep=',', index=False)

In [27]:
df_PS_20200413.iloc[6174]

precio              449.0
producto_id    5289925440
sucursal_id        49-1-2
Name: 6174, dtype: object

In [28]:
df_PS_20200413.iloc[6173]

precio               69.9
producto_id    5030480013
sucursal_id         8-1-8
Name: 6173, dtype: object

In [29]:
df_PS_20200413.dtypes

precio         float64
producto_id     object
sucursal_id     object
dtype: object

Finaliza la limpieza de datos del archivo precios_semana_20200413

Comienza la limpieza de datos del archivo precios_semana_20200503

In [30]:
#accedo al archivo .json
df_PS_20200503=pd.read_json('C:\\Users\\HP\\Documents\\Data Science\\Datasets PI1\\precios_semana_20200503.json')
df_PS_20200503.head()

   precio    producto_id sucursal_id
0    29.9  0000000002288     2-1-187
1    39.9  0000000002288     2-3-247
2  499.99  0000000205870     9-1-685
3  539.99  0000000205870      9-2-22
4  519.99  0000000205870      9-2-59

In [31]:
#convierto los datos de la columna producto_id en numericos
df_PS_20200503['producto_id'] = pd.to_numeric(df_PS_20200503['producto_id'], errors='coerce')

In [32]:
#convierto el .json en .csv
df_PS_20200503.to_csv('C:\\Users\\HP\\Documents\\Data Science\\Datasets PI1\\precios_semana_20200503.csv', index=False)
df_PS_20200503.csv=pd.read_csv('/Users/HP/Documents/Data Science/Datasets PI1/precios_semana_20200503.csv', sep=',', decimal='.', encoding='utf-8')

C:\Users\HP\AppData\Local\Temp\ipykernel_5356\1231557178.py:3: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  df_PS_20200503.csv=pd.read_csv('/Users/HP/Documents/Data Science/Datasets PI1/precios_semana_20200503.csv', sep=',', decimal='.', encoding='utf-8')

In [33]:
df_PS_20200503.head()

   precio  producto_id sucursal_id
0    29.9       2288.0     2-1-187
1    39.9       2288.0     2-3-247
2  499.99     205870.0     9-1-685
3  539.99     205870.0      9-2-22
4  519.99     205870.0      9-2-59

In [34]:
df_PS_20200503.drop_duplicates(inplace=True)

In [35]:
#consulto Faltantes
df_PS_20200503.isna().sum()

precio            0
producto_id    8814
sucursal_id       0
dtype: int64

In [36]:
df_PS_20200503.dropna(inplace = True)

In [37]:
df_PS_20200503.to_csv('C:\\Users\\HP\\Documents\\Data Science\\Datasets PI1\\precios_semana_20200503.csv', index=False)

In [38]:
# convierto el .txt a .csv
df_PS_20200518=pd.read_csv('C:\\Users\\HP\\Documents\\Data Science\\Datasets PI1\\precios_semana_20200518.txt', sep='|')

In [39]:
#pre visualizo el df
df_PS_20200518.head()

   precio    producto_id sucursal_id
0   29.90  0000000002288     2-1-009
1   32.90  0000000002288     2-1-037
2   36.90  0000000002288     2-1-090
3   39.90  0000000002288     2-3-247
4  499.99  0000000205870     9-1-430

In [40]:
#Verifico datos en blanco
df_PS_20200518.isna().sum()

precio         1960
producto_id       6
sucursal_id       6
dtype: int64

In [41]:
#elimino los datos faltantes y luego verifico
df_PS_20200518.dropna(inplace = True) 
df_PS_20200518.isna().sum()

precio         0
producto_id    0
sucursal_id    0
dtype: int64

In [42]:
#Aplico funcion para quitar digitos
df_PS_20200518["producto_id"]=df_PS_20200518["producto_id"].apply(saca_digitos)

In [43]:
df_PS_20200518.drop_duplicates(inplace=True)

In [44]:
#Genero el csv
df_PS_20200518.to_csv('C:\\Users\\HP\\Documents\\Data Science\\Datasets PI1\\precios_semana_20200518.csv', index=False)

In [45]:
#previsualizo el DF
df_PS_20200518.head()

   precio    producto_id sucursal_id
0   29.90  0000000002288     2-1-009
1   32.90  0000000002288     2-1-037
2   36.90  0000000002288     2-1-090
3   39.90  0000000002288     2-3-247
4  499.99  0000000205870     9-1-430

In [46]:
#importo libreria openpyxl para convertir .XLSX en .CSV
import openpyxl as xlsx

df_PS_20200419=pd.read_excel('C:\\Users\\HP\\Documents\\Data Science\\Datasets PI1\\precios_semanas_20200419_20200426.xlsx','precios_20200419_20200419')

df_PS_20200419.to_csv('C:\\Users\\HP\\Documents\\Data Science\\Datasets PI1\\precios_semana_20200419.csv', index=False)

In [47]:
#verifico los vacios
df_PS_20200419.isna().sum()

precio         1807
sucursal_id       0
producto_id       0
dtype: int64

In [48]:
#elimino los vacios
df_PS_20200419.dropna(inplace = True)

In [49]:
df_PS_20200419.drop_duplicates(inplace=True)

In [50]:
#verifico los vacios
df_PS_20200419.isna().sum()

precio         0
sucursal_id    0
producto_id    0
dtype: int64

In [51]:
df_PS_20200419.head()

   precio          sucursal_id producto_id
0   29.90              2-1-184        2288
1   39.90              2-1-206        2288
2  499.99              9-1-430      205870
3  539.99              9-2-107      205870
4  539.99  5218-03-09 00:00:00      205870

In [52]:
#aplico funcion lambda en cambio a str
df_PS_20200419.sucursal_id=df_PS_20200419.sucursal_id.apply(lambda _: str(_))

In [53]:
#elimino los digitos incorrectos en columna sucursal_id
df_PS_20200419['sucursal_id']=df_PS_20200419['sucursal_id'].apply(lambda x: x.split(' ')[0])

In [54]:
df_PS_20200419.head()

   precio sucursal_id producto_id
0   29.90     2-1-184        2288
1   39.90     2-1-206        2288
2  499.99     9-1-430      205870
3  539.99     9-2-107      205870
4  539.99  5218-03-09      205870

In [55]:
#Reordeno las columas
df_PS_20200419= df_PS_20200419[['precio','producto_id','sucursal_id']]
df_PS_20200419.columns

Index(['precio', 'producto_id', 'sucursal_id'], dtype='object')

In [56]:
df_PS_20200419.head()

   precio producto_id sucursal_id
0   29.90        2288     2-1-184
1   39.90        2288     2-1-206
2  499.99      205870     9-1-430
3  539.99      205870     9-2-107
4  539.99      205870  5218-03-09

In [57]:
df_PS_20200419.dtypes

precio         float64
producto_id     object
sucursal_id     object
dtype: object

In [58]:
#registro cambios en el csv
df_PS_20200419.to_csv('C:\\Users\\HP\\Documents\\Data Science\\Datasets PI1\\precios_semana_20200419.csv', index=False)

In [59]:
#Convierto .parquet en .csv
producto=pd.read_parquet('C:\\Users\\HP\\Documents\\Data Science\\Datasets PI1\\producto.parquet')
producto.head()

,id,marca,nombre,presentacion,categoria1,categoria2,categoria3
0,0000000001663,LA ANÓNIMA,Radicheta Atada La Anonima 1 Un,1.0 un,None,None,None
1,0000000002288,LA ANÓNIMA,Perejil Atado La Anonima 1 Un,1.0 un,None,None,None
2,0000000205870,SIN MARCA,Ojo de Bife 1 Kg,1.0 kg,None,None,None
3,0000000205894,SIN MARCA,Milanesa de Peceto Novillito 1 Kg,1.0 kg,None,None,None
4,0000000205955,SIN MARCA,Chiquizuela Novillito 1 Kg,1.0 kg,None,None,None

In [60]:
producto.to_csv('C:\\Users\\HP\\Documents\\Data Science\\Datasets PI1\\producto.csv', index=False)

In [61]:
#renombro columna
producto.rename(columns={'id':'producto_id'}, inplace=True)

In [62]:
producto.head()

,producto_id,marca,nombre,presentacion,categoria1,categoria2,categoria3
0,0000000001663,LA ANÓNIMA,Radicheta Atada La Anonima 1 Un,1.0 un,None,None,None
1,0000000002288,LA ANÓNIMA,Perejil Atado La Anonima 1 Un,1.0 un,None,None,None
2,0000000205870,SIN MARCA,Ojo de Bife 1 Kg,1.0 kg,None,None,None
3,0000000205894,SIN MARCA,Milanesa de Peceto Novillito 1 Kg,1.0 kg,None,None,None
4,0000000205955,SIN MARCA,Chiquizuela Novillito 1 Kg,1.0 kg,None,None,None

In [63]:
#Aplico la función id_P en columna producto_id
producto["producto_id"]=producto["producto_id"].apply(saca_digitos)

In [64]:
#verifico duplicados
producto["producto_id"].unique()

array(['0000000001663', '0000000002288', '0000000205870', ...,
       '9990385651922', '9990385651939', '9990385651946'], dtype=object)

In [65]:
producto['producto_id'].duplicated()

0        False
1        False
2        False
3        False
4        False
         ...
72033    False
72034    False
72035    False
72036    False
72037    False
Name: producto_id, Length: 72038, dtype: bool

In [66]:
producto.drop_duplicates(inplace=True)

In [67]:
print(producto.dtypes)

producto_id     object
marca           object
nombre          object
presentacion    object
categoria1      object
categoria2      object
categoria3      object
dtype: object

In [72]:
producto.to_csv('C:\\Users\\HP\\Documents\\Data Science\\Datasets PI1\\producto.csv', index=False, sep=',', decimal='.')

In [73]:
#trabajo con csv sucursal
sucursal=pd.read_csv('C:\\Users\\HP\\Documents\\Data Science\\Datasets PI1\\sucursal.csv')

In [74]:
#renombro columnas
sucursal.rename(columns={'id':'sucursal_id'}, inplace=True)

In [75]:
sucursal.head()

,sucursal_id,comercioId,banderaId,banderaDescripcion,comercioRazonSocial,provincia,localidad,direccion,lat,lng,sucursalNombre,sucursalTipo
0,1-1-7,1,1,Super MAMI,Dinosaurio S.A.,AR-X,SALSIPUEDES,E53 1011 None,-31.126667,-64.295250,Super Mami 4,Hipermercado
1,10-1-1,10,1,Hipermercado Carrefour,INC S.A.,AR-B,San Isidro,Bernardo De Irigoyen 2647,-34.491345,-58.589025,San Isidro,Hipermercado
2,10-1-10,10,1,Hipermercado Carrefour,INC S.A.,AR-B,Hurlingham,Av. Vergara 1910,-34.620610,-58.633769,Villa Tesei,Hipermercado
3,10-1-11,10,1,Hipermercado Carrefour,INC S.A.,AR-B,Malvinas Argentinas,Av. Arturo Illia 3770,-34.528883,-58.701631,Malvinas Argentinas,Hipermercado
4,10-1-112,10,1,Hipermercado Carrefour,INC S.A.,AR-A,Salta,20 De Febrero 37,-24.789072,-65.413699,Salta,Hipermercado

In [76]:
sucursal.isna().sum()

sucursal_id            0
comercioId             0
banderaId              0
banderaDescripcion     0
comercioRazonSocial    0
provincia              0
localidad              0
direccion              0
lat                    0
lng                    0
sucursalNombre         0
sucursalTipo           0
dtype: int64

In [77]:
sucursal.isnull().sum()

sucursal_id            0
comercioId             0
banderaId              0
banderaDescripcion     0
comercioRazonSocial    0
provincia              0
localidad              0
direccion              0
lat                    0
lng                    0
sucursalNombre         0
sucursalTipo           0
dtype: int64

In [78]:
print(sucursal.dtypes)

sucursal_id             object
comercioId               int64
banderaId                int64
banderaDescripcion      object
comercioRazonSocial     object
provincia               object
localidad               object
direccion               object
lat                    float64
lng                    float64
sucursalNombre          object
sucursalTipo            object
dtype: object

In [79]:
sucursal.to_csv('C:\\Users\\HP\\Documents\\Data Science\\Datasets PI1\\sucursal.csv', index=False, sep=',', decimal='.')

In [84]:
#concatenacion de los df de precios y conversion en un solo CSV
df_precios_compilados=pd.concat([df_PS_20200419, df_PS_20200413, df_PS_20200518, df_PS_20200503])
df_precios_compilados.describe
df_precios_compilados.to_csv('C:\\Users\\HP\\Documents\\Data Science\\Datasets PI1\\precios_compilados.csv', index=False, sep=',', decimal='.')